In [65]:
import pandas as pd

In [66]:
users_df = pd.read_csv('../data/raw/user.csv')
team_points_df = pd.read_csv('../data/raw/team_point.csv')

In [67]:
team_points_df.head()

   team_id  category_id  period  score  place
0     1948            2       0     16      2
1     1934            3       4     45      6
2     1894            4       8     24      4
3     1688            4       0     27      4
4     1592            4       2     21      5

In [68]:
team_results_df = pd.DataFrame(data={'team_id': users_df['team_id'].unique()})

In [69]:
for category_id in range(1,7):
    for period in range (0,5):
        temp_df = team_points_df[(team_points_df['category_id']==category_id)&(team_points_df['period']==period)][['team_id','score', 'place']]\
            .rename(columns={'score':f'score_{category_id}_{period}', 'place':f'place_{category_id}_{period}'})
        team_results_df = team_results_df.merge(temp_df, on='team_id')

In [70]:
team_results_df[['team_id', 'score_4_2', 'place_4_2']].head()

   team_id  score_4_2  place_4_2
0     1664         29          3
1     1690         31          2
2     1394         35          3
3     1908         25          4
4     1592         21          5

In [72]:
users_df = users_df.merge(team_results_df, left_on='team_id', right_on='team_id')
users_df.set_index('user_id', inplace=True)

In [73]:
users_df.head()

,team_id,game_id,score_1_0,place_1_0,score_1_1,place_1_1,score_1_2,place_1_2,score_1_3,place_1_3,...,score_6_0,place_6_0,score_6_1,place_6_1,score_6_2,place_6_2,score_6_3,place_6_3,score_6_4,place_6_4
user_id,,,,,,,,,,,,,,,,,,,,,
10189,1664,235,4,5,4,2,4,5,1,3,...,158,5,170,1,170,2,151,3,143,4
10672,1664,235,4,5,4,2,4,5,1,3,...,158,5,170,1,170,2,151,3,143,4
10565,1664,235,4,5,4,2,4,5,1,3,...,158,5,170,1,170,2,151,3,143,4
10295,1664,235,4,5,4,2,4,5,1,3,...,158,5,170,1,170,2,151,3,143,4
10290,1664,235,4,5,4,2,4,5,1,3,...,158,5,170,1,170,2,151,3,143,4

In [74]:
users_df.drop('team_id', axis=1).to_csv('../data/preprocessed/user_with_team_results.csv', index_label='user_id')